Tekla.Structures.Model.Internal.OverlayModel.IOverlayModelEventHandler


Tekla.Structures.Model.Internal.OverlayModel.IOverlayModelEventHandler.SubscribeEvent(System.String,Tekla.Structures.Model.Internal.OverlayModel.IInternalOverlayModelEvents)
Subscribes an event listener to the event
eventName:  name of the event to subscribe to
eventListener:  Event Listener who is interested in the event
Returns: success/failure

Tekla.Structures.Model.Internal.OverlayModel.IOverlayModelEventHandler.UnsubscribeEvent(System.String,Tekla.Structures.Model.Internal.OverlayModel.IInternalOverlayModelEvents)
Unsuscribes an event listener to the event
eventName:  name of the event to subscribe to
eventListener:  Event Listener who is interested in the event
Returns: success/failure